{
    "sessions": [
        {
            "Title": "Don't just show up. ",
            "Abstract": "Community, is a word we started using at the start of the 14th century, as a way to define a set of common people. In today’s tech scene, we hear this word used everywhere but do you really feel part of one? For the past decade I’ve spent over 10k hours fostering and developing different communities. Some small, and some large efforts such as THAT Conference but what I’ve come to learn is what I’m here to share.\n\nBeing part of a community is easy, being present and active is something completely different. Many will sign up but won’t even bother showing up, The networks, the opportunities, the support are all right in front of you but you have to take the step, that second step. I’ll explain today’s landscape, explore a few techniques, and help you take that second step.",
            "StartTime": "2018-10-06T08:30:00-06:00",
            "EndTime": "2018-10-06T09:45:00-06:00",
            "Id": "1660f708-849c-4076-a9cb-fa5cfcd48313",
            "MainCategory": {
                "Color": "#4B637E",
                "Id": "ba93bcc2-0ca4-4041-be41-8eb885128a5f",
                "Name": "Community",
                "ShortName": "Community"
            },
            "Room": {
                "Name": "Keynote"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "I'm a proud husband, a father, a geek. I love to create; code, pixels, experiences and share them with others. I'm a Product Manager at Telerik making developers even more awesome. I founded an awesome conference, That Conference. Yes, That Conference. I wrench on old muscle cars and live in the great Midwest.\n\nRegardless, I'm just a guy.",
                    "CompanyName": "Unspecified",
                    "FirstName": "Clark",
                    "Id": "32b477e9-940c-4815-901c-cb4814762f0d",
                    "LastName": "Sell",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Founder of THAT Conference"
                }
            ]
        },
        {
            "Title": "Get the Boring Stuff Right: A Guide to Keeping Up with the Latest Tech",
            "Abstract": "Technology is a treadmill. Every year, there's a pile of shiny new things to learn. It's impossible to keep up with all of it. You're constantly asking yourself: \"Which technology stack is going to keep me employed?\"\n\nAs a developer, I love chasing shiny new technologies, but over the years I've learned that making my users happy is way more fulfilling than using the latest technology. After over a decade of building software, I've learned the key to good software is getting the boring stuff right.\n\nIn this talk, you'll learn about why you should spend more time working on evergreen skills. These include skills like creating maintainable code, learning how to learn, and building the right thing. You'll learn what skills have maximum impact and how to improve them. You'll learn how to plan your personal education and make the most of your time. After this talk, you'll be able to sort through the morass of new technologies and make the most of your limited time.",
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "629e5a5b-4d88-4e8a-b6bf-5c765abaa455",
            "TargetLevel" : 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "b040c5c1-0628-4f33-bed6-bafeae750960",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 113"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Dustin Ewers is a consultant at Centare, where he works to help businesses build better software. Dustin has been building software for over 10 years, specializing in Microsoft technologies. He is an active member of the technical community, speaking at user groups and conferences in and around Wisconsin.",
                    "CompanyName": "Centare",
                    "FirstName": "Dustin",
                    "Id": "bac1d6b0-07f3-4638-8d5a-56a153e5d4c7",
                    "LastName": "Ewers",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Consultant"
                }
            ]
        },
        {
            "Title": "Google + Alexa: Cross-Assistant Apps",
            "Abstract": "Let's develop an Action/Skill for Google and Alexa in one neat little package\n\nRemember when the Echo was made available back in late 2014? It was invite only, then Prime only, then finally available for everyone the next summer. Only, most people didn't really seem to care. What does it even do? Why should I bother? Can't I just use my phone?\n\nFast forward to 2018, and it seems like everyone at least knows the Echo, and probably the Google Home. People know how to use them and why you'd have one. The question now has become \"Which one should I get?\" rather than \"Why would I ever buy that?\"\n\nWe've hit the point where people can reasonably expect skills to be on both the Amazon Echo and the Google Home. Both devices are in enough houses where it's worth the investment to create skills and actions for each platform. Luckily, this isn't nearly as difficult as it may seem.\n\nWe'll walk through the creation of both Alexa Skills and Actions on Google, look at the differences (there are a few, mostly names), look at what's the same, and see just how we can build a single application to serve both smart assistants. By the end of the session, we'll have a sample application running on both platforms from a single set of REST endpoints.",
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "3d5689c6-beb1-4c6b-937e-30c9811c5fca",
            "TargetLevel" : 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "b040c5c1-0628-4f33-bed6-bafeae750960",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 114"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Michael Fazio is a Senior Software Engineer with Skyline Technologies, where he helps clients solve all kinds of problems in the web, mobile, and cloud spaces. Fazio is also an organizing committee member for Chicago Code Camp and Milwaukee Code Camp, as well as a presenter at user groups, code camps, and That Conference. Fazio has a love of all things mobile, voice assistants, JavaScript, and REST APIs. Outside of technology, he's always up for a chat about board games, video games, baseball, and late-90s metal bands.",
                    "CompanyName": "Skyline Technologies",
                    "FirstName": "Michael",
                    "Id": "bac1d6b0-07f3-4638-8d5a-56a153e5d4c7",
                    "LastName": "Fazio",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Senior Software Engineer"
                }
            ]
        },
        {
            "Title": "Using CTFs to enforce security awareness in your organization",
            "Abstract": "Remember those \"security awareness\" trainings that are sent out to employees at least once a year? These trainings typically require you to answer multiple choice questions, listen to some boring lecture, and then get a participation certificate. Do employees remember anything from these \"trainings\"? The answer is no, they don't. You may choose this method because it is easy and it checks off the proverbial box, but employees gain very little from this type of self-paced learning. During this session, I will be describing authentic learning activities that use CTFs (Capture the Flag) events to engage and motivate students. Furthermore, you will walk away with a new perspective on how to get employees to naturally think critically about security.",
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "bc464510-0ed4-4c3c-883a-b51eeedf4b49",
            "TargetLevel" : 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "b040c5c1-0628-4f33-bed6-bafeae750960",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 115"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Casey is an IT Instructor at Mid-State Technical College with over 13 years of experience in IT.  He began his career working for a local ISP as a Network Engineer and was eventually introduced to the world of teaching.  Casey has always been passionate about technology and educating those around him. He fails regularly and imparts on his students that failure is not a bad thing.  Recently, Casey graduated from UW-Stout with a degree in Information Communication Technologies.",
                    "CompanyName": "Mid-State Technical College",
                    "FirstName": "Casey",
                    "Id": "460aa4c4-358a-4a90-9026-c8bb769c4603",
                    "LastName": "Trader",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "IT Instructor"
                }
            ]
        },
        {
            "Title": "How Your Corporate Culture Impacts Talent Attraction and Retention - Are You Looking Inside Out?",
            "Abstract": "An organization and the individuals within the organization need to start looking inside themselves to solve the talent attraction and retention puzzle. How your organization and the people inside it communicate, grow, lead, prioritize shapes people coming to your organization and how long they stay.",
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "81dee90b-a7d8-49d2-9bd8-5a603332e4cf",
            "TargetLevel" : 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "b040c5c1-0628-4f33-bed6-bafeae750960",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 116"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Todd Kuckkahn, Executive Director, Portage County Business Council, is also an independent certified coach, teacher, trainer and speaker with The John Maxwell Team. Todd's experiences and perspective give him a unique vantage point into the business world and leadership. His leadership roles include President of a Catholic School and his current role. He also has experience in three state universities at Wisconsin, UW-Platteville and UW-Stevens Point. Todd's undergraduate is a BS-Education from Wisconsin and a MS-Education from UW-Platteville. He is a member of the UW-Platteville Athletic Hall of Fame and has coached first graders through college athletes.",
                    "CompanyName": "Portage County Business Council",
                    "FirstName": "Todd",
                    "Id": "927f8ed6-1526-4e9e-96d7-46c9f3854348",
                    "LastName": "Kuckkahn",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Executive Director"
                }
            ]
        },
        {
            "Title": "Dawn of the Smart Enterprise",
            "Abstract": "We have a smart phone, even a smart home but why not a smart office? Actually, the dawn of the smart enterprise is here - pragmatic AI will enable companies to draw upon data across marketing, sales, and elsewhere to unify marketing automation, CRM, customer success analytics etc. There is nothing more intuitive in interaction than a conversation, whether it is with a human or a bot. We will share our thoughts on we are seeing with our customers and how the move to smart enterprise is starting to happen. We will demo some use-cases that the folks can relate to and also encourage an open discussion during our session.",
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "3d1f822a-8a6d-4b91-88ea-d1b2a08f2ade",
            "TargetLevel" : 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "b040c5c1-0628-4f33-bed6-bafeae750960",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 117"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Founder at Probosys - an ex-IBMer. Providing expert solutions several emerging tech areas. Several clients in WI like Kohler, SCJ, Menasha. Would love to share our experiences.",
                    "CompanyName": "Probosys, LLC",
                    "FirstName": "Bala",
                    "Id": "3162df9a-64bb-43cb-ac95-4ec73ac0bb85",
                    "LastName": "Raghuraman",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Magaging Partner"
                }
            ]
        },
        {
            "Title": "Web Developer to Mobile Apps Developer using NativeScript",
            "Abstract": "Nativescript is a free and open source solution to develop android and IOS based mobile applications. This session will go through the fundamentals of developing Native Mobile Apps using Native Script leveraging the power of Angular, Typescript or JavaScript as your scripting language. A working session will be conducted covering the basics of Native Script and the steps which are required to develop mobile apps.",
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "3d1f822a-8a6d-4b91-88ea-d1b2a08f2ade",
            "TargetLevel" : 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 212"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "With over 10 years of experience developing software applications and designing solutions , he solves complex problems faced by enterprise applications on a day to day basis. He is a technologist and tries to keep himself updated with latest technology advancements. His interest areas include Azure, Kubernetes and NativeScript.",
                    "CompanyName": "Compunnel Software Group",
                    "FirstName": "Baskar",
                    "Id": "5ccfed40-2e7f-48cb-b0c2-0f83b8006378",
                    "LastName": "Rao",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Senior .Net Consultant"
                }
            ]
        },
        {
            "Title": "Agile: Where to Start and Why",
            "Abstract": "Achieving agility almost always involves organizational structure changes that lead to true culture change.\n\nDoing agile is focused on mechanics of frameworks such as Scrum without realizing the true benefits of agility or understanding the “whys” behind the frameworks. Being agile is more about a mindset shift in how we approach work – using agile frameworks with the “whys” in mind and organizing our people to achieve agility.\n\nDoing agile lives within status quo processes; being agile challenges status quo processes with a spirit of continuous improvement.\n\nThis whiteboard talk clarifies what “agile” is, highlights the most important factors in achieving true agility, and why many agile adoptions “fail” to get there.",
            "StartTime": "2018-10-06T11:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "45e61379-19a2-49e8-a1e9-ac30b625adfd",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 113"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "I work with all levels of the organization to optimize your business to respond to change. I am passionate about moving organizations and people closer to agility.\n\nMy first experience with agile, Scrum specifically, was in 2005. I was part of a global transformation team responsible for software customizations driven by a global consolidation of accounting software. We ran into typical implementation challenges and organizational impediments.\n\nAround 2012, my passion for lean, agile, and continuous improvement grew. I left my traditional business analyst and project manager roles behind and evolved into an internal change agent kickstarting an agile transformation. Now in an advising role as an external change agent across many organizations, I promote organizational agility.",
                    "CompanyName": "Whiteboard Consulting",
                    "FirstName": "Chad",
                    "Id": "11c9bedb-9702-440b-837f-dc7e7ff42555",
                    "LastName": "Beier",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Organizational Agility Advisor"
                }
            ]
        },
        {
            "Title": "Kotlin - Less Code, More Fun",
            "Abstract": "Write less (but safer!) code in your Android apps or any JVM-based projects\n\nEver work on an Android app and tire of all the boilerplate code? Or spend hours chasing down NullPointerExceptions in your Java app? Enter Kotlin, JetBrains' new(ish) free, open-source programming language that targets the JVM. This means you can use it everywhere you use Java, but with a modern, succinct syntax.\n\nFor native Android developers, Kotlin is not only available, but it's now considered a first-class language. You're able to write an app completely with Kotlin, or switch over entire components, or even just change your models to Kotlin's data classes (which removes a TON of boilerplate code.)\n\nOh, and for anyone using Java elsewhere, you can add in Kotlin code to your existing application. Kotlin is 100% interoperable with Java, meaning all your existing code/libraries/tests will work with any Kotlin code you write.\n\nDoing JavaScript development? Kotlin can be transpiled into ES5, and there are even libraries available to use React or Angular with Kotlin.\n\nC# dev working on any kind of Java project? You'll feel much more at home with Kotlin, given features like nullable types, properties (rather than getters/setters), and extension methods.\n\nWe'll walk through Kotlin's features, check out the syntax, and even create a small Android application so you can see Kotlin in action.",
            "StartTime": "2018-10-06T11:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "637e5d68-4ea5-4e68-b45d-0d4ee6f68c09",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 114"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Michael Fazio is a Senior Software Engineer with Skyline Technologies, where he helps clients solve all kinds of problems in the web, mobile, and cloud spaces. Fazio is also an organizing committee member for Chicago Code Camp and Milwaukee Code Camp, as well as a presenter at user groups, code camps, and That Conference. Fazio has a love of all things mobile, voice assistants, JavaScript, and REST APIs. Outside of technology, he's always up for a chat about board games, video games, baseball, and late-90s metal bands.",
                    "CompanyName": "Skyline Technologies",
                    "FirstName": "Michael",
                    "Id": "bac1d6b0-07f3-4638-8d5a-56a153e5d4c7",
                    "LastName": "Fazio",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Senior Software Engineer"
                }
            ]
        },
        {
            "Title": "SQL - Hot Rod Mechanic Mindset",
            "Abstract": "I am a developer and I cannot seem to find why my SQL query is performing poorly, but it feels like it is. What tools can I use to identify areas of the query that are performing poorly, and how can I make this poorly performing situation better? A brief discussion on tools, tips and tricks to squeeze some performance from SQL. This talk will include a brief discussion on query plans, row-store indexing, and how to find queries that are not so hot.",
            "StartTime": "2018-10-06T11:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "bbaa5345-ef05-48ab-ad16-abbd19947c3f",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 115"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "I am a Software Engineer and I enjoy wearing \"many hats\" while solving a diverse set of problems. At Skyward, Inc. I work on Web application security, SQL performance, web API’s, and mentoring new employees, among other things. When I am not busy during the week deconstructing and solving problems with software, I am spending time with my family and watching my toddler discover nature. On an average weekend, you can find me rock climbing, reading, learning, mowing the lawn, taking out the trash, fishing, or drinking coffee on my deck.",
                    "CompanyName": "Skyward, Inc.",
                    "FirstName": "Andrew",
                    "Id": "b5e979aa-537c-49cf-bf48-42d0d36e53e0",
                    "LastName": "Corbisier",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Software Engineer"
                }
            ]
        },
        {
            "Title": "Perceptions, Partnerships and Pipelines; Apprenticeship in Non-Traditional Fields",
            "Abstract": "IT apprenticeship sounds like a new thing to be fearful of—at least until the 2.0 release—but adopting early may mean creating a new and important niche for the Wisconsin Technical College System. The information technology apprenticeship opportunities under the Wisconsin Apprenticeship Growth and Enhancement Strategies (WAGE$) grant are creating an innovative way to meet the workforce development needs of a hungry-for-talent IT industry while providing a pathway to an associate degree and more.",
            "StartTime": "2018-10-06T11:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "3bea48be-717f-44d6-89d1-6b6e5a29e8d9",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 116"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Jason Schenzel has been working as the Associate Dean of the School of Technology for three academic years, and is an IT professional of fourteen years in banking, K-12 and the technical college system, while eight of those years were in administration in education.  He is a life-long learner who always seeks out ways to know more about the job at hand, and explore ways to improve the end result or bottom line.",
                    "CompanyName": "Mid-State Technical College",
                    "FirstName": "Jason",
                    "Id": "7ea921bb-0d47-4028-b79e-92cb7cb636c7",
                    "LastName": "Schenzel",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Associate Dean School of Technology"
                },
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "CompanyName": "Mid-State Technical College",
                    "FirstName": "Mandy",
                    "Id": "3820eecc-1a3b-4d3d-b558-d5d84c143a26",
                    "LastName": "Mayek",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg"
                },
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "CompanyName": "Mid-State Technical College",
                    "FirstName": "Stephanie",
                    "Id": "1d21cd06-6565-4653-9964-a50c590eaf65",
                    "LastName": "Haka",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg"
                }
            ]
        },
        {
            "Title": "Everything Serverless in Azure with Functions and Cosmos",
            "Abstract": "Server less architecture is a current buzz word and there are various offerings to choose from different cloud vendors. The talk will be focused on Azure Functions and the various integration options available as part of Azure Functions. A working session will be conducted where participants can access and create their azure functions and get a hands on overview to understand the various integration options and diagnostic mechanism available to monitor the functions. Developers can choose their language of choice to create their own functions and take advantage of the features available from the platform. The talk will also focus on transforming a legacy Electronic Data Interchange (EDI) solution to Azure Functions and Azure Cosmos DB.",
            "StartTime": "2018-10-06T11:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Id": "22c8c022-2f59-4854-808b-3bae3c5b133c",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 117"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "With over 10 years of experience developing software applications and designing solutions , he solves complex problems faced by enterprise applications on a day to day basis. He is a technologist and tries to keep himself updated with latest technology advancements. His interest areas include Azure, Kubernetes and NativeScript.",
                    "CompanyName": "Compunnel Software Group",
                    "FirstName": "Baskar",
                    "Id": "5ccfed40-2e7f-48cb-b0c2-0f83b8006378",
                    "LastName": "Rao",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Senior .Net Consultant"
                }
            ]
        },
        {
            "Title": "How to build honest business Reporting software?",
            "Abstract": "Brief introduction of my work with QlikView, along with examples of proper source control operations and design, testing and control optimization, and efficient expressions.",
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T14:15:00-06:00",
            "Id": "0116b985-2e34-415e-8b7c-55e998902394",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 113"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "QlikView developer for retail business analytics. Computer engineering at U of I at Springfield.",
                    "CompanyName": "Team Schierl Companies",
                    "FirstName": "Sam",
                    "Id": "e7ed0cfd-ca76-41dd-824e-569d1eb881aa",
                    "LastName": "Klein",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Software Development Specialist"
                }
            ]
        },
        {
            "Title": "Career growth opportunities through remote work",
            "Abstract": "Significant opportunities are available for both organizations and professionals around the subject of remote work. Remote work offers organizations the ability to acquire industry leading talent and have a competitive advantage over non-remote work organizations. For professionals, remote work offers opportunities for career advancement and being competitive in a tight labor market. At the end of this session, both managers and professionals will understand the best places to find remote work opportunities, understand the types of remote work engagements, the key approaches for a successful engagement, and the key characteristics to look for in a remote team environment. Entrepreneurs will also gain from this session by learning practical approaches they can apply towards automating their business.",
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T14:15:00-06:00",
            "Id": "0d863fca-3701-4d40-b972-923e31f7f26b",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 114"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Jonathan Sharp is a remote Senior Software Engineer for NVIDIA working from his home office in Three Lakes, WI. Jonathan has worked remotely since 2008 and is a former entrepreneur having co-founded an enterprise consulting company in 2010. This former organization grew to a staff size of 23 with everyone in the organization working remote and included clients such as: Microsoft, E*TRADE, WalMart, Lowes, Pearson, Scripts Network, AOL, and Purdue Pharma. Jonathan's passion has been growing relationships over distances in the field of IT to find the best talent. He loves the Northwoods and Wisconsin and all that is has to offer his family.",
                    "CompanyName": "NVIDIA",
                    "FirstName": "Jonathan",
                    "Id": "4e58d682-b5db-4f8a-9e5c-6d30b9f62459",
                    "LastName": "Sharp",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Senior Software Engineer"
                }
            ]
        },
        {
            "Title": "Agile for System Administrators/Teams",
            "Abstract": "How to take the best traits from Agile and apply them to everyday work for System Administrator and System Operations team. What works and what you can leave at the off. How to use tools like Git, Ansible, Chat to better facilitate projects in reaching your end goal.",
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T14:15:00-06:00",
            "Id": "995af047-727a-418b-bc86-a296c92ad752",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 115"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Father, husband, want to be gear head and laid back recumbent biker who enjoys putting lines of code together and making systems talk to each other. ",
                    "CompanyName": "Wildcard Corp.",
                    "FirstName": "Timothy",
                    "Id": "b650b468-1225-4836-8eac-aa43858c8f66",
                    "LastName": "Pangburn",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Systems Administrator Sr."
                }
            ]
        },
        {
            "Title": "Ready Player Two: VR Game Dev",
            "Abstract": "In the year 2044, the world is in crisis. To escape that reality, the populace turns to the OASIS, a virtual reality MMORPG that is more than just a game – it is a completely immersive virtual society.\n\nBack in 2018, at the dawn of VR, the seeds of our future were planted. What would come to be a billion dollar market, that changed the world forever, began then…\n\nJoin us in viewing the 2018 talk by the Microsoft MVP Lance Larsen (www.LanceLarsen.com), one of the founders of HOLOSOFT (www.HOLOSOFT.net)\n\nThis historic presentation inspired a generation of VR developers – leading at least in part to the OASIS we have today.\n\nCode focused talk that will get everyone started making Microsoft Mixed Reality VR games…\n\nFocus on the latest and greatest VR hardware and software\nFocus on creating VR experiences within Unity / C# and Visual Studio\nFocus on integrating VR controllers\nFocus on creating your own 3D VR launch icons\n\nTarget Audience and Takeaways: Talk will accommodate a wide range of experience levels, introducing many for the first time to amazing XR/AR/VR technologies – getting them started with the tools and information to get them engaged. Additionally for the more experienced developers, we’ll include strong coding examples and resources to grow quickly and start their development futures in this emerging billion dollar field.",
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T14:15:00-06:00",
            "Id": "55c33cf1-54eb-4f22-ab78-196ad1253399",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 116"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Lance Larsen (Microsoft MVP) is the Chief Visionary Officer (CVO) of HOLOSOFT (www.HOLOSOFT.net) as well avid community speaker, technology evangelist -and- president of MADdotNET, the Madison .NET developer community www.MADdotNET.com! Specialization in Mixed Reality – Hololens and UX.\n\nAt HOLOSOFT, we’ve thrown ourselves into the deep end of MR/AR/VR; Mixed Reality, Augmented Reality and Virtual Reality – and we’ll catch you up on what we’ve learned, available technologies, emerging technologies and the tools we use to write beautiful applications.\n\nLance is also one of the original organizers of That Conference (www.ThatConference.com) – the original Summer Camp for Geeks in the Wisconsin Dells!\n\n@holosoftnet | www.HOLOSOFT.net\n@lancelarsen | www.LanceLarsen.com | lance@holosoft.net",
                    "CompanyName": "HOLOSOFT",
                    "FirstName": "Lance",
                    "Id": "c896bee7-6185-4893-8429-ab1a5618bed9",
                    "LastName": "Larsen",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Chief Visionary Officer"
                }
            ]
        },
        {
            "Title": "C# Everywhere with Blazor",
            "Abstract": "C# has long been recognized as a robust and powerful language, favored by developers across the globe. What if you were able to write C# across the stack, even replacing JavaScript code? With the new experimental Blazor framework, you can do it! Come to learn about Blazor, where it is headed, and learn about the power of writing a single-page application (SPA) in C# without any non-standard plugins or extensions.",
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T14:15:00-06:00",
            "Id": "a65e9955-4c38-4af6-a043-9c1d936cfc41",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 117"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Dave Brock is a software engineer at CUNA Mutual Group in Madison, Wisconsin, where he is a full-stack developer in the Microsoft stack - working on C#, SQL Server, as well as front-end work with JS and TypeScript. He enjoys speaking and sharing his knowledge and blogs at his site (daveabrock.com). When not at his day job, he enjoys various side coding projects and being ordered around by his two small children and his not-so-small dog. ",
                    "CompanyName": "CUNA Mutual Group",
                    "FirstName": "Dave",
                    "Id": "eef92722-4958-4b66-bb5c-867886531e87",
                    "LastName": "Brock",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Software Engineer"
                }
            ]
        },
        {
            "Title": "Applying Design Patterns to Everyday Problems",
            "Abstract": "Have you read about design patterns but weren’t quite sure how or where to apply them in your application? Have you heard of principles like loose coupling and programming to an abstraction, but didn’t know if you were really doing it right? If so, this talk is for you.\n\nIn this talk, I’ll work from several example code segments and show how to recognize which design pattern would be appropriate. I’ll then show how to refactor the existing code to use the chosen design pattern and demonstrate how the resulting code is more understandable, easier to maintain and easier to test.\n\nAmong the examples I will show is how a dependency on an external system can be refactored using an interface and applying the bridge and adaptor pattern. I’ll also show how to use the decorator pattern to cache results from an external call. Finally, I’ll show examples of how patterns like the strategy pattern and chain of responsibility pattern can replace large blocks of if/else if statements to create a simpler design that is easier to test.\n\nWhen this talk is complete, you will have a good idea of how to recognize where these patterns can be applied in your codebase and how you go about implementing them.",
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T14:15:00-06:00",
            "Id": "8e30775f-f422-47ee-9edf-f2199b847773",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 212"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "I'm a Solutions Architect with over 20 years of experience in building software systems. I started out as a Java developer and then switched to .NET in 2003. I've also done significant work with SQL Server and Oracle. I'm a Pluralsight author and have presented at community events throughout the Midwest.\n\nI try to bring a pragmatic approach to everything I do, making sure the software I build is simple, understandable and balances responsibilities between different components of the system. When speaking or teaching, I emphasize real world scenarios encountered by developers every day and show how to solve them so you can be more effective at what you do.",
                    "CompanyName": "AdvantEdge Analytics",
                    "FirstName": "David",
                    "Id": "d61ec515-6fc1-4483-afd1-a28b1791df09",
                    "LastName": "Berry",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Solutions Architect"
                }
            ]
        },
        {
            "Title": "Stacking the Deck",
            "Abstract": "Wildcard debuts and demonstrates experimental and production, in-house, security technologies and tools. We'll go over design considerations, implementation, use cases, and real world scenarios.",
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Id": "820cb274-cb96-4a13-8337-de456106aa3d",
            "TargetLevel": 300,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 113"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Daniel Cronce is a penetration tester for Wildcard Corp. He likes to push the boundaries and test assumptions in everything he does.\n\nWhen he isn't actively red-teaming for a client, he hacks on tools and toys to make his job easier.",
                    "CompanyName": "WildCard Corp.",
                    "FirstName": "Daniel",
                    "Id": "42cfc1d1-b6c1-4715-b677-63af43bef4e2",
                    "LastName": "Cronce",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Penetration Tester"
                },
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Justin Moravec is an information security specialist at Wildcard Corp. Justin has worked in information security and information technology for the last 8 years. His background stems from working with with Wildcard Corp and government entities such as DoD and NGA.",
                    "CompanyName": "WildCard Corp.",
                    "FirstName": "Justin",
                    "Id": "7bb56f78-3131-4718-95da-24b215d287f3",
                    "LastName": "Moravec",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Information Security Specialist"
                }
            ]
        },
        {
            "Title": "Integrating Machine and Statistical Learning with Analytics Knowledge Management",
            "Abstract": "This talk is based on the work developed (Edwards and Rodriguez, 2018) on the relationship between analytics, big data and knowledge management. The presentation includes a conceptual action-orientated model connecting data, analytics techniques, knowledge and patterns/insights. In the conversation, there is an illustration of categories and examples of analytics/big data projects, comparing several applications.\n\nA particular focus is the difference between one-off projects, even if they lead to ongoing results, such as sensor monitoring, and ongoing activity or a series of projects. In the latter, we expect to find influences of knowledge on data (what to collect, and standardization of meaning), knowledge on techniques (new techniques developed in the light of past examples) and action on knowledge (learning from skilled practice).\n\nLinks will also be made to the higher-level issues that drive analytics efforts - or at least should do. These include a definition of problems, goals, and objectives, and measurement of organizational/project performance. This raises the question of the relationship between knowledge management and strategic risk management.",
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Id": "fa845b7d-c44b-47fb-9b53-1c65b044d81b",
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 114"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Eduardo Rodriguez is the Sentry Insurance Endowed Chair in Business Analytics at the University of Wisconsin - Stevens Point.  He is Analytics Adjunct Professor at Telfer School of Management, University of Ottawa, Canada; Principal of IQAnalytics Inc., a Research Centre and Consultancy in Canada ad Senior Associate-Faculty of the Center for Dynamic Leadership Models in Global Business at The Leadership Alliance Inc. He holds a BMath and an MBA, from Los Andes University, Colombia, an MSc. in Mathematics, from Concordia University, Canada, and a Ph.D. from Aston Business School, UK. He has extensive experience in knowledge and risk management and in analytics in financial institutions. He has been Knowledge Management Advisor and Quantitative Analyst at EDC Canada, and Regional Director of PRMIA in Ottawa, and is the creator of the Think-Tank in Analytics, author of six books in analytics, reviewer for four journals and with publications in various peer-reviewed journals and conferences. His main research interest is in the application of knowledge management to risk management and business analytics.",
                    "CompanyName": "University of Wisconsin Stevens Point",
                    "FirstName": "Eduardo",
                    "Id": "b5da110f-3135-4a94-b775-8d6efa15ca24",
                    "LastName": "Rodriguez",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg"
                }
            ]
        },
        {
            "Title": "Setting Priority in the Enterprise",
            "Abstract": "Mature enterprises will always have more work requested from their IT teams than can actually be delivered at any one time. I'll discuss some how a Product Owner can get a handle on all the work, create visibility to the entire organization and prioritize so there is always just one \"number one priority\".",
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Id": "2d48c220-a96e-4d11-84f2-c96fa264c672",
            "TargetLevel": 400,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 115"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "25 years in IT; from programmer to project manager to manager to product owner. I utilize all I know of IT and business to prioritize work that will bring the greatest value to the business.  ",
                    "CompanyName": "Delta Dental of Wisconsin",
                    "FirstName": "Aaron",
                    "Id": "a7f0d363-f4fe-472b-bfc5-bf765468121c",
                    "LastName": "Kremin",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName" : "Product Owner"
                },
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "CompanyName": "Delta Dental of Wisconsin",
                    "FirstName": "Michael",
                    "Id": "8f8a2700-c2fd-4648-9a67-510c5ada0c29",
                    "LastName": "Upright",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName" : "Director of IT"
                }
            ]
        },
        {
            "Title": "How to build a highly scalable web and mobile-ended applications without managing servers",
            "Abstract": "Starting a new web or mobile project is always fun for a developer. However, as the project moves on, requirements can get increasingly complex fast. Building a highly secure login experience, user analytics, managing storage, offline support, caching, defining APIs, and making everything scalable and secure are all non-trivial exercises. Further, many of these non-functional requirements are really just table stakes, and not what sets your app apart in the market. In this session, we will show you how to build a web and mobile application that enables all of these non-functional requirements in just a few lines of code using cloud-based backend services that enable you to move faster in getting your unique application features to market without worrying about the heavy lifting on the backend.",
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Id": "39f80bc1-fa97-4443-ab56-763e4609463d",
            "TargetLevel": 200,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 116"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Andrew has 20+ years of experience building consumer-facing web applications as a full-stack developer and architect. He has held various software engineering, architecture, and leadership roles in companies large and small, including Wisconsin-based Renaissance Learning.\n\nAndy worked for 11 years for Pearson, a global education company, and was privileged to lead an architecture team that spanned the globe and supported a $1B part of the business. During that time, he worked extensively on API standards, architecture and DevOps practices, and content strategy.\n\nAndy currently works remotely from Rhinelander, WI, as a solutions architect for Amazon Web Services.",
                    "CompanyName": "Amazon Web Services",
                    "FirstName": "Andrew",
                    "Id": "727e71c7-ce46-49c2-a288-330adc901c1d",
                    "LastName": "Elmhorst",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName" : "Senior Solutions Architect"
                }
            ]
        },
        {
            "Title": "Exception Driven Development",
            "Abstract": "What is \"Exception Driven Development\"? If customer-facing issues are your top priority, then you already adhere to the primary principle of Exception Driven Development.\n\nIt's a pretty simple concept: Collect application data, especially regarding errors and crashes, and then focus on fixing those problems that your users are actually experiencing. Join me for 60 minutes and I'll walk you through what you're doing wrong with your current log collection approach, and how you should be doing it. Additionally, we'll cover visualizing errors in a more meaningful manner that eliminates all the noise.",
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Id": "4dca843f-2643-49d5-812a-89c3b0d096c0",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 117"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "MVP, ❤ OSS, Distributed Newbie, Pilot, Snowboarder & Bee Keeper!",
                    "CompanyName": "Exceptionless",
                    "FirstName": "Blake",
                    "Id": "aa0e3d62-c118-4129-b85a-0d4a090846be",
                    "LastName": "Niemyjski",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName" : "Vice President"
                }
            ]
        },
        {
            "Title": "Get Started with Windows 10 IoT Core!",
            "Abstract": "Microsoft has a special version of Windows 10 to target Internet of Things (IoT) devices, where you can develop using your favorite tech like Visual Studio and C#.\n\nThis session will provide a concise walk-through of getting started with Win10 IoT Core on a Rasberry Pi while discussing pros/cons from burnt-fingers in the field. We’ll discuss the development side of IoT, meaning from the device, to the code and sending it to the cloud, like Azure. We will not be covering the Big Data and reporting side of IoT in this session other than mentions of how that fits into the bigger picture.\n\nYou’ll leave understanding how to quickly get started and remove the barriers to entry for you own side-project or even a pitch to make at your job.",
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Id": "0477026e-d3cb-4380-917f-e7035208531b",
            "TargetLevel": 100,
            "MainCategory": {
                "Color": "#B8E986",
                "Id": "5292b471-251d-4a79-9859-0a1cd72aa164",
                "Name": "General Dev",
                "ShortName": "General Dev"
            },
            "Room": {
                "Name": "Room 212"
            },
            "Speakers": [
                {
                    "AvatarUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "Biography": "Greg Levenhagen is a Principal Consultant with Skyline Technologies, a Microsoft Regional Director (RD) and a Microsoft Most Valuable Professional (MVP). He has a great passion for giving back to the community and teaching. A true enthusiast of computer science, with passions and interests including AR/MR/VR, mobile, UX, architecture, distributed computing, automated testing, web, agile, 3D/games, cloud, languages and much more. Greg speaks at conferences like ThatConference, CodeMash, VSLive and Code PaLOUsa. He is also a Microsoft Certified Trainer (MCT), board member of ThatConference, president of the Milwaukee Code Camp, president of the Northeast WI Code Camp, president of the Northeast WI Developers User Group, co-organizer of the Fox Valley Game Development Meetup, co-organizer of the Midwest Azure User Group, organizer of MobileMKE, cofounder of the Northeast WI Agile User Group, INETA speaker and IEEE and ACM member.",
                    "CompanyName": "Skyline Technologies",
                    "FirstName": "Greg",
                    "Id": "bdbf2e4e-8697-48c3-af84-2bfe93ef5723",
                    "LastName": "Levenhagen",
                    "PhotoUrl": "https://mbevivino.files.wordpress.com/2011/08/silhouette_i-m-congnito.jpg",
                    "PositionName": "Principal Consultant"
                }
            ]
        }
    ],
    "featured_events": [
        {
            "StartTime": "2018-10-06T07:30:00-06:00",
            "EndTime": "2018-10-06T08:30:00-06:00",
            "Title": "Registration Check-ins & Exhibits"
        },
        {
            "StartTime": "2018-10-06T08:30:00-06:00",
            "EndTime": "2018-10-06T09:45:00-06:00",
            "Title": "Opening & Keynote"
        },
        {
            "StartTime": "2018-10-06T09:45:00-06:00",
            "EndTime": "2018-10-06T10:00:00-06:00",
            "Title": "Break/Exibits"
        },
        {
            "StartTime": "2018-10-06T10:00:00-06:00",
            "EndTime": "2018-10-06T10:45:00-06:00",
            "Title": "Sessions"
        },
        {
            "StartTime": "2018-10-06T10:45:00-06:00",
            "EndTime": "2018-10-06T11:00:00-06:00",
            "Title": "Break/Exibits"
        },
        {
            "StartTime": "2018-10-06T11:00:00-06:00",
            "EndTime": "2018-10-06T11:45:00-06:00",
            "Title": "Sessions"
        },
        {
            "StartTime": "2018-10-06T11:45:00-06:00",
            "EndTime": "2018-10-06T13:30:00-06:00",
            "Title": "Lunch & Networking"
        },
        {
            "StartTime": "2018-10-06T13:30:00-06:00",
            "EndTime": "2018-10-06T04:15:00-06:00",
            "Title": "Sessions"
        },
        {
            "StartTime": "2018-10-06T14:15:00-06:00",
            "EndTime": "2018-10-06T14:30:00-06:00",
            "Title": "Break/Exibits"
        },
        {
            "StartTime": "2018-10-06T14:30:00-06:00",
            "EndTime": "2018-10-06T15:15:00-06:00",
            "Title": "Sessions"
        },
        {
            "StartTime": "2018-10-06T15:15:00-06:00",
            "EndTime": "2018-10-06T15:30:00-06:00",
            "Title": "Break/Exibits"
        },
        {
            "StartTime": "2018-10-06T15:30:00-06:00",
            "EndTime": "2018-10-06T16:00:00-06:00",
            "Title": "Closing Session"
        },
        {
            "Description": "Join sponsors and attendees on the Patio at Guu's on Main for a happy hour and networking. Guu's on Main is located just south of Cobbletone Hotel.",
            "StartTime": "2018-10-06T16:00-06:00",
            "EndTime": "2018-10-06T16:30-06:00",
            "LocationName": "Guu's on Main",
            "SponsorId": "78a29e04-f16f-4ecd-b2fd-55287177fc09",
            "Title": "Networking Social"
        }
    ],
    "sponsors": [
        {
            "Description": "CWITA is a group of action focused employers in central Wisconsin working together to enhance the image of IT careers and position the region as a hub for IT opportunities. CWITA collaborates with the K-16 education system to strengthen IT career pathways and assist in growing our regional IT workforce.",
            "Id": "ebd8e1f6-0b60-4f92-bc0f-9916f68f678f",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_0a380afe71f24ec3a4438aac44d0da0f~mv2.png/v1/fill/w_220,h_68,al_c,usm_0.66_1.00_0.01/615d66_0a380afe71f24ec3a4438aac44d0da0f~mv2.png",
            "Name": "CWITA",
            "Rank": 0,
            "SponsorLevel": {
                "Name": "Organizer",
                "Rank": 0
            },
            "WebsiteUrl": "http://cwita.org"
        },
        {
            "Description": "Central Wisconsin is FULL of technical enthusists. Let's meet and learn from one another. Great minds are in your backyard!",
            "Id": "eed0480d-220c-430a-b1b1-8d332462edcd",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_25923432d6974e4d9babd26c8e608f3d~mv2.jpg/v1/fill/w_208,h_97,al_c,q_80,usm_0.66_1.00_0.01/615d66_25923432d6974e4d9babd26c8e608f3d~mv2.jpg",
            "Name": "CENWIDEV",
            "Rank": 1,
            "SponsorLevel": {
                "Name": "Organizer",
                "Rank": 1
            },
            "TwitterUrl": "cenwidev",
            "WebsiteUrl": "http://cenwidev.org"
        },
        {
            "Description": "Mid-State is one of 16 colleges in the Wisconsin Technical College System. It is a leading provider of higher education offering many career opportunities through associate degrees, technical diplomas and certificates. Student-focused and community-based, Mid-State serves a resident population of approximately 165,000 in central Wisconsin.\n\nThe college has campuses in Marshfield, Stevens Point and Wisconsin Rapids, and a learning center in Adams. Visit the College’s website at mstc.edu.\n\n92% of Mid-State alumni are employed within six months after graduation; 79% of graduates work in the Mid-State District comprising all or portions of Adams, Clark, Jackson, Juneau, Marathon, Portage, Waushara, and Wood Counties.",
            "Id": "3941eb01-ba31-4374-ae9b-57dce7d475f2",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_7e995f8d8fef408985da8bfaefd4d561~mv2.jpg/v1/fill/w_219,h_50,al_c,q_80,usm_0.66_1.00_0.01/615d66_7e995f8d8fef408985da8bfaefd4d561~mv2.jpg",
            "Name": "Mid-State Technical College",
            "Rank": 2,
            "SponsorLevel": {
                "Name": "Organizer",
                "Rank": 2
            },
            "TwitterUrl": "followmstc",
            "WebsiteUrl": "https://www.mstc.edu"
        },
        {
            "Description": "CREATE is a 501(c)3 nonprofit that sees community challenges as opportunities to envision a more vibrant and engaging community. We are building partnerships and streamlining resources to ensure that those creative visions have a real impact on Central Wisconsin. We are making creativity central to community development, economic growth, and our quality of life.",
            "Id": "0e766c8a-15f6-43de-b10d-2aefd6814299",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_2cc6da6194ff4187b631ee21e9218a4a~mv2.png/v1/fill/w_207,h_78,al_c,usm_0.66_1.00_0.01/615d66_2cc6da6194ff4187b631ee21e9218a4a~mv2.png",
            "Name": "Create Portage County",
            "Rank": 3,
            "SponsorLevel": {
                "Name": "Community Partner",
                "Rank": 0
            },
            "TwitterUrl": "createpoco",
            "WebsiteUrl": "http://www.createportagecounty.org"
        },
        {
            "Description": "A better SIS and ERP experience for school districts and municipalities. We're about more than just software.",
            "Id": "57e28728-701f-4d9a-9a2e-7fb4a0cae7fd",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_4bd0173adda347bbb3184523a7f8e91a~mv2.jpg/v1/fill/w_204,h_110,al_c,q_80,usm_0.66_1.00_0.01/615d66_4bd0173adda347bbb3184523a7f8e91a~mv2.jpg",
            "Name": "Skyward",
            "Rank": 4,
            "SponsorLevel": {
                "Name": "Gold Sponsor",
                "Rank": 1
            },
            "TwitterUrl": "skyward_inc",
            "WebsiteUrl": "https://www.skyward.com"
        },
        {
            "Description": "Every student can become their most amazing self with the guidance of an expert teacher to unlock their full potential. Renaissance exists to salute those teachers at the heart of every classroom.\n\nWe bring the best of data analytics and research-based practice to support teachers nationwide. Teachers take it from there – after all, their guidance and warmth are the key component of student growth.",
            "Id": "a83098df-e346-4e6a-9537-dff0e7f5710e",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_fd56f3314ec44641a613005d88090194~mv2.jpg/v1/fill/w_579,h_52,al_c,q_80,usm_0.66_1.00_0.01/615d66_fd56f3314ec44641a613005d88090194~mv2.jpg",
            "Name": "Renaissance Learning",
            "Rank": 5,
            "SponsorLevel": {
                "Name": "Silver Sponsor",
                "Rank": 0
            },
            "TwitterUrl": "RenLearnUS",
            "WebsiteUrl": "https://www.renaissance.com"
        },
        {
            "Description": "CyberOne Data owns and operates it's own private data center with multiple carriers, redundant power, climate controlled cooling, clean agent fire suppression and network systems that allow us to quickly deploy dedicated servers, facilitate simple colocation arrangements and provide reliable performance at all times.",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_3385b6dae94d44e5955e97751fb3d76c~mv2.jpg/v1/fill/w_307,h_56,al_c,q_80,usm_0.66_1.00_0.01/615d66_3385b6dae94d44e5955e97751fb3d76c~mv2.jpg",
            "Name": "CyberOne Data",
            "Rank": 6,
            "SponsorLevel": {
                "Name": "Silver Sponsor",
                "Rank": 2
            },
            "WebsiteUrl": "https://www.cyberonedata.com"
        },
        {
            "Description": "Heartland Farms mission is to produce a healthy and safe food product, maximize profitability, and maintain good ethical values. We are a family-owned and operated farm and plan to ensure this opportunity to the next generation. We strive to make efficient use of inputs, maintain excellent land stewardship practices, and produce high quality commodities for the end user.",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_4757288db2714da7ad76d07711cd834a~mv2.jpg/v1/fill/w_261,h_166,al_c,q_80,usm_0.66_1.00_0.01/615d66_4757288db2714da7ad76d07711cd834a~mv2.webp",
            "Name": "Heartland Farms, Inc",
            "Rank": 7,
            "SponsorLevel": {
                "Name": "Silver Sponsor",
                "Rank": 2
            },
            "WebsiteUrl": "https://www.cyberonedata.com"
        },
        {
            "Id": "78a29e04-f16f-4ecd-b2fd-55287177fc09",
            "ImageUrl": "http://www.nrconsults.com/wp-content/themes/nrc_theme-2/images/logo-nrc.png",
            "Name": "New Resources Consulting",
            "Rank": 10,
            "SponsorLevel": {
                "Name": "Additional Sponsor",
                "Rank": 1
            },
            "WebsiteUrl": "http://www.nrconsults.com"
        },
        {
            "Description": "CyberOne Data owns and operates it's own private data center with multiple carriers, redundant power, climate controlled cooling, clean agent fire suppression and network systems that allow us to quickly deploy dedicated servers, facilitate simple colocation arrangements and provide reliable performance at all times.",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_93905e998df046078b5ef3cbf67abfc5~mv2.jpg/v1/fill/w_307,h_74,al_c,q_80,usm_0.66_1.00_0.01/615d66_93905e998df046078b5ef3cbf67abfc5~mv2.jpg",
            "Name": "EO Johnson Business Technologies",
            "Rank": 11,
            "SponsorLevel": {
                "Name": "Additional Sponsor",
                "Rank": 1
            },
            "TwitterUrl": "EOJohnsonCo",
            "WebsiteUrl": "https://www.eojohnson.com"
        },
        {
            "Description": "Delta Dental is the nation's oldest & largest dental benefits provider. Tweets on oral health tips, industry trends & community benefit news.",
            "ImageUrl": "https://static.wixstatic.com/media/615d66_83d4a1f106c84adbad97514067d650b1~mv2.png/v1/fill/w_468,h_46,al_c,q_80,usm_0.66_1.00_0.01/615d66_83d4a1f106c84adbad97514067d650b1~mv2.webp",
            "Name": "Delta Dental",
            "Rank": 11,
            "SponsorLevel": {
                "Name": "Additional Sponsor",
                "Rank": 1
            },
            "TwitterUrl": "deltadental",
            "WebsiteUrl": "https://www.eojohnson.com"
        }
    ],
    "lunch_locations": [
        {
            "address1": "900 Block, Clark Street",
            "address2": "Stevens Point, WI 54481",
            "category": "Food Truck",
            "imageUri": "https://www.gannett-cdn.com/-mm-/f7d85f610c6fec9e25cd9504d72dbb25dd375661/c=1-0-959-720&r=x404&c=534x401/local/-/media/2016/05/31/WIGroup/StevensPoint/636003067209178599-13263786-1340256619324828-4126962239843597190-n.jpg",
            "latitude": 44.522474,
            "longitude": -89.585493,
            "name": "Chef C's Munchie Mobile",
            "website": "https://www.facebook.com/chefcfoodtruck/?fref=ts"
        },
        {
            "address1": "1140 Main St",
            "address2": "Stevens Point, WI 54481",
            "category": "Bar & Grill",
            "imageUri": "http://wiparty.com/Stevens%20Point%20Bars/Guu%27s%20On%20Main/Guu%27s-on-Main-Stevens-Point.jpg",
            "latitude": 44.523454,
            "longitude": -89.582776,
            "name": "Guu's on Main",
            "website": "https://www.facebook.com/Guus-on-Main-76860951468/"
        },
        {
            "address1": "925 Clark St",
            "address2": "Stevens Point, WI 54481",
            "category": "Sandwiches",
            "imageUri": "http://galaxycomicsandgames.com/wp-content/uploads/2014/06/Galaxy_logo.png",
            "latitude": 44.522493,
            "longitude": -89.58529,
            "name": "Galaxy Comics, Games and More",
            "website": "http://galaxycomicsandgames.com"
        },
        {
            "address1": "1059 Main St",
            "address2": "Stevens Point, WI 54481",
            "category": "Omelets, pancakes, soups & sandwiches",
            "imageUri": "http://thewoodenchairstevenspoint.com",
            "latitude": 44.523334,
            "longitude": -89.583439,
            "name": "The Wooden Chair"
        },
        {
            "address1": "1410 3rd St",
            "address2": "Stevens Point, WI 54481",
            "category": "Coffee & Sandwiches",
            "imageUri": "http://thecoffeestudio.biz/wp-content/themes/thecoffeestudio/images/logo.png",
            "latitude": 44.523471,
            "longitude": -89.583435,
            "name": "The Coffee Studio",
            "website": "http://thecoffeestudio.biz"
        },
        {
            "address1": "956 Main St",
            "address2": "Stevens Point, WI 54481",
            "category": "Bar & Grill",
            "imageUri": "https://scontent.feau1-1.fna.fbcdn.net/v/t1.0-9/38297831_317830048957247_2637664722144460800_n.jpg?_nc_cat=104&oh=0a10fd9388ef7356d9eb896244f98eb9&oe=5C52ACD7",
            "latitude": 44.523614,
            "longitude": -89.584758,
            "name": "Main Street Taps",
            "website": "https://www.facebook.com/MainStreetTaps/"
        }
    ]
}
